**Read in master table**

In [36]:
#Read in master table
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
master_df = pd.read_csv('data/Master_Table.csv')
master_df = master_df.drop(columns='Unnamed: 0')
master_df.head()

,Title_ID,Title,Year,Runtime_Minutes,Genres,Lifetime_Gross
0,tt0369610,Jurassic World,2015,124.0,"Action,Adventure,Sci-Fi",652270625.0
1,tt0401729,John Carter,2012,132.0,"Action,Adventure,Sci-Fi",73078100.0
2,tt1179034,From Paris with Love,2010,92.0,"Action,Crime,Thriller",24077427.0
3,tt1194173,The Bourne Legacy,2012,135.0,"Action,Adventure,Thriller",113203870.0
4,tt1219289,Limitless,2011,105.0,"Mystery,Sci-Fi,Thriller",79249455.0

In [37]:
master_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3188 entries, 0 to 3187
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Title_ID         3188 non-null   object
 1   Title            3188 non-null   object
 2   Year             3188 non-null   int64
 3   Runtime_Minutes  3158 non-null   float64
 4   Genres           3184 non-null   object
 5   Lifetime_Gross   3188 non-null   float64
dtypes: float64(2), int64(1), object(3)
memory usage: 149.6+ KB

**Pull In Principal Data & Explore**

In [38]:
principals = pd.read_csv('data/imdb.title.principals.csv.gz')
names = pd.read_csv('data/imdb.name.basics.csv.gz')
names_only = names[['nconst', 'primary_name']]
principals_names = principals.merge(names_only, on='nconst', how='left')
principals_names.drop(columns = ["ordering", "job", "characters"], inplace = True)
principals_names.rename(columns={'tconst':'Title_ID', 'nconst':'Name_ID', 'category':'Role', 'primary_name':'Name'}, inplace = True)
principals_names.head()

    Title_ID    Name_ID      Role                   Name
0  tt0111414  nm0246005     actor           Tommy Dysart
1  tt0111414  nm0398271  director           Frank Howson
2  tt0111414  nm3739909  producer  Barry Porter-Robinson
3  tt0323808  nm0059247    editor            Sean Barton
4  tt0323808  nm3579312   actress        Brittania Nicol

In [39]:
principals_names.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1028186 entries, 0 to 1028185
Data columns (total 4 columns):
 #   Column    Non-Null Count    Dtype
---  ------    --------------    -----
 0   Title_ID  1028186 non-null  object
 1   Name_ID   1028186 non-null  object
 2   Role      1028186 non-null  object
 3   Name      1027912 non-null  object
dtypes: object(4)
memory usage: 39.2+ MB

In [40]:
principals_names['Name'].value_counts()

Kevin MacLeod           378
William Shakespeare     160
Eric Roberts            148
Brahmanandam            126
Sen Arima               103
                       ...
Robert Pacitti            1
Roman Griffin Davis       1
Jaimie Giadordano         1
Shehrezad Maher           1
Ludwig Paredes Funes      1
Name: Name, Length: 575032, dtype: int64

In [41]:
principals_names['Role'].value_counts()

actor                  256718
director               146393
actress                146208
producer               113724
cinematographer         80091
composer                77063
writer                  74357
self                    65424
editor                  55512
production_designer      9373
archive_footage          3307
archive_sound              16
Name: Role, dtype: int64

In [42]:
people_master = master_df.merge(principals_names, how='left', on='Title_ID')
people_master = people_master.dropna(subset=['Name'])
people_master.head()

,Title_ID,Title,Year,Runtime_Minutes,Genres,Lifetime_Gross,Name_ID,Role,Name
0,tt0369610,Jurassic World,2015,124.0,"Action,Adventure,Sci-Fi",652270625.0,nm0189777,producer,Patrick Crowley
1,tt0369610,Jurassic World,2015,124.0,"Action,Adventure,Sci-Fi",652270625.0,nm0695435,actor,Chris Pratt
2,tt0369610,Jurassic World,2015,124.0,"Action,Adventure,Sci-Fi",652270625.0,nm0397171,actress,Bryce Dallas Howard
3,tt0369610,Jurassic World,2015,124.0,"Action,Adventure,Sci-Fi",652270625.0,nm1339223,actor,Ty Simpkins
4,tt0369610,Jurassic World,2015,124.0,"Action,Adventure,Sci-Fi",652270625.0,nm0339460,actress,Judy Greer

In [43]:
people_master.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30722 entries, 0 to 30724
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Title_ID         30722 non-null  object
 1   Title            30722 non-null  object
 2   Year             30722 non-null  int64
 3   Runtime_Minutes  30495 non-null  float64
 4   Genres           30687 non-null  object
 5   Lifetime_Gross   30722 non-null  float64
 6   Name_ID          30722 non-null  object
 7   Role             30722 non-null  object
 8   Name             30722 non-null  object
dtypes: float64(2), int64(1), object(6)
memory usage: 2.3+ MB

In [44]:
people_master.to_csv(path_or_buf='data/People_Master.csv')